Revit 2024 API
Wall.Orientation Property
 The normal vector projected from the exterior side of the wall.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public XYZ Orientation { get; }
Visual Basic
Public ReadOnly Property Orientation As XYZ
	Get
Visual C++
public:
property XYZ^ Orientation {
	XYZ^ get ();
}
See Also
Wall Class
Autodesk.Revit.DB Namespace